app/controllers/faileds_controller.rb

SELECT "faileds".* FROM "faileds"
---
    def index
        @faileds = Failed.all