app/controllers/imports_controller.rb

SELECT "imports".* FROM "imports"
---
    def index
        @imports = Import.all

DELETE FROM "imports"
DELETE FROM "faileds"
---
    def import
        Import.delete_all
        Failed.delete_all