app/controllers/welcome_controller.rb

SELECT "imports".* FROM "imports"
---
  def index
      @imports = Import.all